nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/demo_apps/mc_pmsm/pmsm_enc/peripherals.c
#if defined(PIT0_MOD_L_INIT) && defined(PIT0_MOD_H_INIT)
    PIT0->MOD_L = PIT0_MOD_L_INIT;
    PIT0->MOD_H = PIT0_MOD_H_INIT;
#endif
#if defined(PIT0_MOD_INIT)
    PIT0->MOD = PIT0_MOD_INIT;
#endif
#if defined(PIT0_FILT_INIT)
    PIT0->FILT = PIT0_FILT_INIT;
#endif
#if defined(PIT0_CTRL2_INIT)
    PIT0->CTRL2 = PIT0_CTRL2_INIT;
#endif
#if defined(PIT0_CTRL_INIT)
#if ((PIT0_CTRL_INIT & PIT_CTRL_CNT_EN_MASK) != 0)
    PIT0->CTRL = (PIT0_CTRL_INIT & (~PIT_CTRL_CNT_EN_MASK));
    PIT0->CTRL |= PIT_CTRL_CNT_EN_MASK;
#else
    PIT0->CTRL = PIT0_CTRL_INIT;
#endif
#endif
}

/***********************************************************************************************************************
 * PWMA initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'PWMA'
- type: 'pwm_reg'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'pwm_reg_d49946f7b366f6b63d56e6e76fd333cc'
- functional_group: 'BOARD_InitPeripherals'
- peripheral: 'PWMA'
- config_sets:
  - fsl_pwm:
    - clockSource: 'SystemClock'
    - clockSourceFreq: 'custom:100 MHz'
    - pllMonitor: '0'
    - stretch_count: '0'
    - writeProtect: '0'
    - submodules:
      - 0:
        - sm: 'kPWM_Module_0'
        - sm_template_params: []
        - config:
          - clockSource: 'kPWM_BusClock'
          - prescale: '0'
          - compareMode: '0'
          - loadOK: 'true'
          - startCounter: 'true'
          - signed_unsigned: 'signed'
          - init: '-5000'
          - val1: '4999'
          - fracval1: '0'
          - val0: '0'
          - val2: '-2500'
          - fracval2: '0'
          - val3: '2500'
          - fracval3: '0'
          - val4: '-4980'
          - fracval4: '0'
          - val5: '0'
          - fracval5: '0'
          - initializationControl: '0'
          - enableDebugMode: 'false'
          - enableWait: 'false'
          - pairOperation: '0'
          - pairMain: '0'
          - deadtime_logic_inputs:
            - pwm23:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
            - pwm45:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
          - deadtime_params:
            - deadTime0:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
            - deadTime1:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
          - reloadControl:
            - reloadImmediate: 'false'
            - reloadLogic: 'kPWM_ReloadPwmFullCycle'
            - reloadSelect: '0'
            - reloadFrequency: '0'
          - forceControl:
            - forceTrigger: '0'
            - pwm23Init: '0'
            - pwm45Init: '0'
            - pwmxInit: '0'
            - forceEn: 'false'
          - fracControl:
            - fracEn: ''
            - powerUp: 'false'
          - doubleSwitching:
            - doubleEn: 'false'
            - doubleX: 'false'
            - split: '0'
          - outputEn: ''
          - outputMask: ''
          - maskImmediately: 'false'
          - outputTrigger_sel: 'kPWM_ValueRegister_4'
          - triggerFrequency: '0'
          - interrupt_sel: ''
          - interrupt_flags: ''
          - dma_used: 'false'
          - dma:
            - pwmDMA_activate: 'false'
            - captureDMA_enable: ''
            - captureDMA_source: '0'
            - captureDMA_watermark_control: '0'
        - channels:
          - 0:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 1:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 2:
            - functionSel: 'notUsed'
        - compare_interruptEn: 'false'
        - compare_interrupt:
          - IRQn: 'keFlexPWMA_CMP0_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - reload_interruptEn: 'false'
        - reload_interrupt:
          - IRQn: 'keFlexPWMA_RELOAD0_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
      - 1:
        - sm: 'kPWM_Module_1'
        - sm_template_params: []
        - config:
          - clockSource: 'kPWM_Submodule0Clock'
          - prescale: '0'
          - compareMode: '0'
          - loadOK: 'true'
          - startCounter: 'true'
          - signed_unsigned: 'signed'
          - init: '-5000'
          - val1: '4999'
          - fracval1: '0'
          - val0: '0'
          - val2: '-2500'
          - fracval2: '0'
          - val3: '2500'
          - fracval3: '0'
          - val4: '0'
          - fracval4: '0'
          - val5: '0'
          - fracval5: '0'
          - initializationControl: '2'
          - phaseDly: '0'
          - enableDebugMode: 'false'
          - enableWait: 'false'
          - pairOperation: '0'
          - pairMain: '0'
          - deadtime_logic_inputs:
            - pwm23:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
            - pwm45:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
          - deadtime_params:
            - deadTime0:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
            - deadTime1:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
          - reloadControl:
            - reloadImmediate: 'false'
            - reloadLogic: 'kPWM_ReloadPwmFullCycle'
            - reloadSelect: '1'
            - reloadFrequency: '0'
          - forceControl:
            - forceTrigger: '0'
            - pwm23Init: '0'
            - pwm45Init: '0'
            - pwmxInit: '0'
            - forceEn: 'false'
          - fracControl:
            - fracEn: ''
            - powerUp: 'false'
          - doubleSwitching:
            - doubleEn: 'false'
            - doubleX: 'false'
            - split: '0'
          - outputEn: ''
          - outputMask: ''
          - maskImmediately: 'false'
          - outputTrigger_sel: ''
          - triggerFrequency: '0'
          - interrupt_sel: ''
          - interrupt_flags: ''
          - dma_used: 'false'
          - dma:
            - pwmDMA_activate: 'false'
            - captureDMA_enable: ''
            - captureDMA_source: '0'
            - captureDMA_watermark_control: '0'
        - channels:
          - 0:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 1:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 2:
            - functionSel: 'notUsed'
        - compare_interruptEn: 'false'
        - compare_interrupt:
          - IRQn: 'keFlexPWMA_CMP1_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - reload_interruptEn: 'false'
        - reload_interrupt:
          - IRQn: 'keFlexPWMA_RELOAD1_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
      - 2:
        - sm: 'kPWM_Module_2'
        - sm_template_params: []
        - config:
          - clockSource: 'kPWM_Submodule0Clock'
          - prescale: '0'
          - compareMode: '0'
          - loadOK: 'true'
          - startCounter: 'true'
          - signed_unsigned: 'signed'
          - init: '-5000'
          - val1: '4999'
          - fracval1: '0'
          - val0: '0'
          - val2: '-2500'
          - fracval2: '0'
          - val3: '2500'
          - fracval3: '0'
          - val4: '0'
          - fracval4: '0'
          - val5: '0'
          - fracval5: '0'
          - initializationControl: '2'
          - phaseDly: '0'
          - enableDebugMode: 'false'
          - enableWait: 'false'
          - pairOperation: '0'
          - pairMain: '0'
          - deadtime_logic_inputs:
            - pwm23:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
            - pwm45:
              - deadtime_input_by_force: '0'
              - SW_value: '0'
          - deadtime_params:
            - deadTime0:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
            - deadTime1:
              - clockSource: 'kPWM_BusClock'
              - deadtimeValue: '50'
          - reloadControl:
            - reloadImmediate: 'false'
            - reloadLogic: 'kPWM_ReloadPwmFullCycle'
            - reloadSelect: '1'
            - reloadFrequency: '0'
          - forceControl:
            - forceTrigger: '0'
            - pwm23Init: '0'
            - pwm45Init: '0'
            - pwmxInit: '0'
            - forceEn: 'false'
          - fracControl:
            - fracEn: ''
            - powerUp: 'false'
          - doubleSwitching:
            - doubleEn: 'false'
            - doubleX: 'false'
            - split: '0'
          - outputEn: ''
          - outputMask: ''
          - maskImmediately: 'false'
          - outputTrigger_sel: ''
          - triggerFrequency: '0'
          - interrupt_sel: ''
          - interrupt_flags: ''
          - dma_used: 'false'
          - dma:
            - pwmDMA_activate: 'false'
            - captureDMA_enable: ''
            - captureDMA_source: '0'
            - captureDMA_watermark_control: '0'
        - channels:
          - 0:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 1:
            - functionSel: 'pwmOutput'
            - pwm:
              - level: '0'
              - fault_channel0:
                - dismap: 's0'
              - fault_channel1:
                - dismap: ''
              - faultState: '0'
          - 2:
            - functionSel: 'notUsed'
        - compare_interruptEn: 'false'
        - compare_interrupt:
          - IRQn: 'keFlexPWMA_CMP2_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
        - reload_interruptEn: 'false'
        - reload_interrupt:
          - IRQn: 'keFlexPWMA_RELOAD2_VECTORn'
          - dsc_enable_interrrupt: 'iprVal0'
          - enable_custom_name: 'false'
    - faultChannels:
      - 0:
        - commonFaultSetting:
          - clockSource: 'kPWM_BusClock'
          - faultFilterPeriod: '20'
          - faultFilterCount: '5'
          - faultGlitchStretch: 'false'
          - testFault: 'false'
        - faults:
          - 0:
            - faultClearingMode: 'kPWM_Automatic'
            - faultLevelR: '1'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_RecoverFullCycle'
            - fault_int_source: 'false'
          - 1:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 2:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 3:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
        - fault_template_params: []
      - 1:
        - commonFaultSetting:
          - clockSource: 'kPWM_BusClock'
          - faultFilterPeriod: '0'
          - faultFilterCount: '3'
          - faultGlitchStretch: 'false'
          - testFault: 'false'
        - faults:
          - 0:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 1:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 2:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
          - 3:
            - faultClearingMode: 'kPWM_ManualNormal'
            - faultLevelR: '0'
            - enableCombinationalPathR: '0'
            - recoverMode: 'kPWM_NoRecovery'
            - fault_int_source: 'false'
        - fault_template_params: []
    - capture_interruptEn: 'false'
    - capture_interrupt:
      - IRQn: 'keFlexPWMA_CAP_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
    - fault_interruptEn: 'false'
    - fault_interrupt:
      - IRQn: 'keFlexPWMA_FAULT_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
    - error_interruptEn: 'false'
    - error_interrupt:
      - IRQn: 'keFlexPWMA_RERR_VECTORn'
      - dsc_enable_interrrupt: 'iprVal0'
      - enable_custom_name: 'false'
    - pwm_common_template_params: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */

static void PWMA_init(void) {
/****************************************************************************/
/* Submodule 1 initialization */
/****************************************************************************/
  /* Disable the submodule and its output before the submodule init. */
  PWMA->OUTEN &= ~(PWM_OUTEN_PWMA_EN(1U << 1) | PWM_OUTEN_PWMB_EN(1U << 1) | PWM_OUTEN_PWMX_EN(1U << 1));
  PWMA->MCTRL &= ~(PWM_MCTRL_RUN(1U << 1) | PWM_MCTRL_CLDOK(1U << 1));
#ifdef PWMA_SM1CTRL_INIT
  PWMA->SM[1].CTRL = PWMA_SM1CTRL_INIT;
#else
  PWMA->SM[1].CTRL = 0x400U;
#endif /* PWMA_SM1CTRL_INIT */
#ifdef PWMA_SM1CTRL2_INIT
  PWMA->SM[1].CTRL2 = PWMA_SM1CTRL2_INIT;
#else
  PWMA->SM[1].CTRL2 = 0x0U;
#endif /* PWMA_SM1CTRL2_INIT */
#ifdef PWMA_SM1INIT_INIT
  PWMA->SM[1].INIT = PWMA_SM1INIT_INIT;
#else
  PWMA->SM[1].INIT = 0x0U;
#endif /* PWMA_SM1INIT_INIT */
#ifdef PWMA_SM1VAL0_INIT
  PWMA->SM[1].VAL0 = PWMA_SM1VAL0_INIT;
#else
  PWMA->SM[1].VAL0 = 0x0U;
#endif /* PWMA_SM1VAL0_INIT */
#ifdef PWMA_SM1VAL1_INIT
  PWMA->SM[1].VAL1 = PWMA_SM1VAL1_INIT;
#else
  PWMA->SM[1].VAL1 = 0x0U;
#endif /* PWMA_SM1VAL1_INIT */
#ifdef PWMA_SM1VAL2_INIT
  PWMA->SM[1].VAL2 = PWMA_SM1VAL2_INIT;
#else
  PWMA->SM[1].VAL2 = 0x0U;
#endif /* PWMA_SM1VAL2_INIT */
#ifdef PWMA_SM1VAL3_INIT
  PWMA->SM[1].VAL3 = PWMA_SM1VAL3_INIT;
#else
  PWMA->SM[1].VAL3 = 0x0U;
#endif /* PWMA_SM1VAL3_INIT */
#ifdef PWMA_SM1VAL4_INIT
  PWMA->SM[1].VAL4 = PWMA_SM1VAL4_INIT;
#else
  PWMA->SM[1].VAL4 = 0x0U;
#endif /* PWMA_SM1VAL4_INIT */
#ifdef PWMA_SM1VAL5_INIT
  PWMA->SM[1].VAL5 = PWMA_SM1VAL5_INIT;
#else
  PWMA->SM[1].VAL5 = 0x0U;
#endif /* PWMA_SM1VAL5_INIT */
#if (defined(PWMA_SM1_FRACTIONAL_BLOCK_AVAILABLE))
#ifdef PWMA_SM1FRACVAL1_INIT
  PWMA->SM[1].FRACVAL1 = PWMA_SM1FRACVAL1_INIT;
#else
  PWMA->SM[1].FRACVAL1 = 0x0U;
#endif /* PWMA_SM1FRACVAL1_INIT */
#ifdef PWMA_SM1FRACVAL2_INIT
  PWMA->SM[1].FRACVAL2 = PWMA_SM1FRACVAL2_INIT;
#else
  PWMA->SM[1].FRACVAL2 = 0x0U;
#endif /* PWMA_SM1FRACVAL2_INIT */
#ifdef PWMA_SM1FRACVAL3_INIT
  PWMA->SM[1].FRACVAL3 = PWMA_SM1FRACVAL3_INIT;
#else
  PWMA->SM[1].FRACVAL3 = 0x0U;
#endif /* PWMA_SM1FRACVAL3_INIT */
#ifdef PWMA_SM1FRACVAL4_INIT
  PWMA->SM[1].FRACVAL4 = PWMA_SM1FRACVAL4_INIT;
#else
  PWMA->SM[1].FRACVAL4 = 0x0U;
#endif /* PWMA_SM1FRACVAL4_INIT */
#ifdef PWMA_SM1FRACVAL5_INIT
  PWMA->SM[1].FRACVAL5 = PWMA_SM1FRACVAL5_INIT;
#else
  PWMA->SM[1].FRACVAL5 = 0x0U;
#endif /* PWMA_SM1FRACVAL5_INIT */
#ifdef PWMA_SM1FRCTRL_INIT
  PWMA->SM[1].FRCTRL = PWMA_SM1FRCTRL_INIT;
#else
  PWMA->SM[1].FRCTRL = 0x0U;
#endif /* PWMA_SM1FRCTRL_INIT */
#endif /* (defined(PWMA_SM1_FRACTIONAL_BLOCK_AVAILABLE)) */
#ifdef PWMA_SM1OCTRL_INIT
  PWMA->SM[1].OCTRL = PWMA_SM1OCTRL_INIT;
#else
  PWMA->SM[1].OCTRL = 0x0U;
#endif /* PWMA_SM1OCTRL_INIT */
#ifdef PWMA_SM1STS_INIT
  PWMA->SM[1].STS = PWMA_SM1STS_INIT;
#else
  PWMA->SM[1].STS = 0x3fffU;
#endif /* PWMA_SM1STS_INIT */
#ifdef PWMA_SM1INTEN_INIT
  PWMA->SM[1].INTEN = PWMA_SM1INTEN_INIT;
#else
  PWMA->SM[1].INTEN = 0x0U;
#endif /* PWMA_SM1INTEN_INIT */
#ifdef PWMA_SM1DMAEN_INIT
  PWMA->SM[1].DMAEN = PWMA_SM1DMAEN_INIT;
#else
  PWMA->SM[1].DMAEN = 0x0U;
#endif /* PWMA_SM1DMAEN_INIT */
#ifdef PWMA_SM1TCTRL_INIT
  PWMA->SM[1].TCTRL = PWMA_SM1TCTRL_INIT;
#else
  PWMA->SM[1].TCTRL = 0x0U;
#endif /* PWMA_SM1TCTRL_INIT */
#ifdef PWMA_SM1DISMAP0_INIT
  PWMA->SM[1].DISMAP[0] = PWMA_SM1DISMAP0_INIT;
#else
  PWMA->SM[1].DISMAP[0] = 0xffffU;
#endif /* PWMA_SM1DISMAP0_INIT */
#ifdef PWMA_SM1DISMAP1_INIT
  PWMA->SM[1].DISMAP[1] = PWMA_SM1DISMAP1_INIT;
#else
  PWMA->SM[1].DISMAP[1] = 0xffffU;
#endif /* PWMA_SM1DISMAP1_INIT */
#ifdef PWMA_SM1DTCNT0_INIT
  PWMA->SM[1].DTCNT0 = PWMA_SM1DTCNT0_INIT;
#else
  PWMA->SM[1].DTCNT0 = 0x7ffU;
#endif /* PWMA_SM1DTCNT0_INIT */
#ifdef PWMA_SM1DTCNT1_INIT
  PWMA->SM[1].DTCNT1 = PWMA_SM1DTCNT1_INIT;
#else
  PWMA->SM[1].DTCNT1 = 0x7ffU;
#endif /* PWMA_SM1DTCNT1_INIT */

#ifdef PWM_CAPTCTRLA_EDGA0_MASK
#ifdef PWMA_SM1CAPTCTRLA_INIT
  PWMA->SM[1].CAPTCTRLA = PWMA_SM1CAPTCTRLA_INIT;
#else
  PWMA->SM[1].CAPTCTRLA = 0x0U;
#endif /* PWMA_SM1CAPTCTRLA_INIT */
#ifdef PWMA_SM1CAPTCOMPA_INIT
  PWMA->SM[1].CAPTCOMPA = PWMA_SM1CAPTCOMPA_INIT;
#else
  PWMA->SM[1].CAPTCOMPA = 0x0U;
#endif /* PWMA_SM1CAPTCOMPA_INIT */
#endif /* PWM_CAPTCTRLA_EDGA0_MASK */

