nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/demo_apps/mc_pmsm/pmsm_enc/peripherals.c
#ifdef PWM_CAPTFILTA_CAPTA_FILT_PER_MASK
  PWMA->SM[2].CAPTFILTA = 0x0U;
#ifdef PWMA_SM2CAPTFILTA_INIT
  PWMA->SM[2].CAPTFILTA = PWMA_SM2CAPTFILTA_INIT;
#endif
#endif  /* PWM_CAPTFILTA_CAPTA_FILT_PER_MASK */

#ifdef PWM_CAPTCTRLB_EDGB0_MASK
#ifdef PWMA_SM2CAPTCTRLB_INIT
  PWMA->SM[2].CAPTCTRLB = PWMA_SM2CAPTCTRLB_INIT;
#else
  PWMA->SM[2].CAPTCTRLB = 0x0U;
#endif /* PWMA_SM2CAPTCTRLB_INIT */
#ifdef PWMA_SM2CAPTCOMPB_INIT
  PWMA->SM[2].CAPTCOMPB = PWMA_SM2CAPTCOMPB_INIT;
#else
  PWMA->SM[2].CAPTCOMPB = 0x0U;
#endif /* PWMA_SM2CAPTCOMPB_INIT */
#endif /* PWM_CAPTCTRLB_EDGB0_MASK */

#ifdef PWM_CAPTFILTB_CAPTB_FILT_PER_MASK
  PWMA->SM[2].CAPTFILTB = 0x0U;
#ifdef PWMA_SM2CAPTFILTB_INIT
  PWMA->SM[2].CAPTFILTB = PWMA_SM2CAPTFILTB_INIT;
#endif
#endif  /* PWM_CAPTFILTB_CAPTB_FILT_PER_MASK */

#ifdef PWM_CAPTCTRLX_EDGX0_MASK
#ifdef PWMA_SM2CAPTCTRLX_INIT
  PWMA->SM[2].CAPTCTRLX = PWMA_SM2CAPTCTRLX_INIT;
#else
  PWMA->SM[2].CAPTCTRLX = 0x0U;
#endif /* PWMA_SM2CAPTCTRLX_INIT */
#ifdef PWMA_SM2CAPTCOMPX_INIT
  PWMA->SM[2].CAPTCOMPX = PWMA_SM2CAPTCOMPX_INIT;
#else
  PWMA->SM[2].CAPTCOMPX = 0x0U;
#endif /* PWMA_SM2CAPTCOMPX_INIT */
#endif /* PWM_CAPTCTRLX_EDGX0_MASK */

#ifdef PWM_CAPTFILTX_CAPTX_FILT_PER_MASK
  PWMA->SM[2].CAPTFILTX = 0x0U;
#ifdef PWMA_SM2CAPTFILTX_INIT
  PWMA->SM[2].CAPTFILTX = PWMA_SM2CAPTFILTX_INIT;
#endif
#endif  /* PWM_CAPTFILTX_CAPTX_FILT_PER_MASK */

#if (0 != 2)
#ifdef PWM_PHASEDLY_PHASEDLY_MASK
#ifdef PWMA_SM2PHASEDLY_INIT
  PWMA->SM[2].PHASEDLY = PWMA_SM2PHASEDLY_INIT;
#else
  PWMA->SM[2].PHASEDLY = 0x0U;
#endif /* PWMA_SM2PHASEDLY_INIT */
#endif /* PWM_PHASEDLY_PHASEDLY_MASK */
#endif /* (0 != 2) */
#if ((!defined(PWMA_SM2CTRL_INIT)) || (0U == (PWMA_SM2CTRL_INIT & PWM_CTRL_LDMOD_MASK)))
  PWMA->MCTRL |= PWM_MCTRL_LDOK(1U << 2);
#endif /* ((!defined(PWMA_SM2CTRL_INIT)) || (0U == (PWMA_SM2CTRL_INIT & PWM_CTRL_LDMOD_MASK))) */

/****************************************************************************/
/* Submodule 0 initialization */
/****************************************************************************/
  /* Disable the submodule and its output before the submodule init. */
  PWMA->OUTEN &= ~(PWM_OUTEN_PWMA_EN(1U << 0) | PWM_OUTEN_PWMB_EN(1U << 0) | PWM_OUTEN_PWMX_EN(1U << 0));
  PWMA->MCTRL &= ~(PWM_MCTRL_RUN(1U << 0) | PWM_MCTRL_CLDOK(1U << 0));
#ifdef PWMA_SM0CTRL_INIT
  PWMA->SM[0].CTRL = PWMA_SM0CTRL_INIT;
#else
  PWMA->SM[0].CTRL = 0x400U;
#endif /* PWMA_SM0CTRL_INIT */
#ifdef PWMA_SM0CTRL2_INIT
  PWMA->SM[0].CTRL2 = PWMA_SM0CTRL2_INIT;
#else
  PWMA->SM[0].CTRL2 = 0x0U;
#endif /* PWMA_SM0CTRL2_INIT */
#ifdef PWMA_SM0INIT_INIT
  PWMA->SM[0].INIT = PWMA_SM0INIT_INIT;
#else
  PWMA->SM[0].INIT = 0x0U;
#endif /* PWMA_SM0INIT_INIT */
#ifdef PWMA_SM0VAL0_INIT
  PWMA->SM[0].VAL0 = PWMA_SM0VAL0_INIT;
#else
  PWMA->SM[0].VAL0 = 0x0U;
#endif /* PWMA_SM0VAL0_INIT */
#ifdef PWMA_SM0VAL1_INIT
  PWMA->SM[0].VAL1 = PWMA_SM0VAL1_INIT;
#else
  PWMA->SM[0].VAL1 = 0x0U;
#endif /* PWMA_SM0VAL1_INIT */
#ifdef PWMA_SM0VAL2_INIT
  PWMA->SM[0].VAL2 = PWMA_SM0VAL2_INIT;
#else
  PWMA->SM[0].VAL2 = 0x0U;
#endif /* PWMA_SM0VAL2_INIT */
#ifdef PWMA_SM0VAL3_INIT
  PWMA->SM[0].VAL3 = PWMA_SM0VAL3_INIT;
#else
  PWMA->SM[0].VAL3 = 0x0U;
#endif /* PWMA_SM0VAL3_INIT */
#ifdef PWMA_SM0VAL4_INIT
  PWMA->SM[0].VAL4 = PWMA_SM0VAL4_INIT;
#else
  PWMA->SM[0].VAL4 = 0x0U;
#endif /* PWMA_SM0VAL4_INIT */
#ifdef PWMA_SM0VAL5_INIT
  PWMA->SM[0].VAL5 = PWMA_SM0VAL5_INIT;
#else
  PWMA->SM[0].VAL5 = 0x0U;
#endif /* PWMA_SM0VAL5_INIT */
#if (defined(PWMA_SM0_FRACTIONAL_BLOCK_AVAILABLE))
#ifdef PWMA_SM0FRACVAL1_INIT
  PWMA->SM[0].FRACVAL1 = PWMA_SM0FRACVAL1_INIT;
#else
  PWMA->SM[0].FRACVAL1 = 0x0U;
#endif /* PWMA_SM0FRACVAL1_INIT */
#ifdef PWMA_SM0FRACVAL2_INIT
  PWMA->SM[0].FRACVAL2 = PWMA_SM0FRACVAL2_INIT;
#else
  PWMA->SM[0].FRACVAL2 = 0x0U;
#endif /* PWMA_SM0FRACVAL2_INIT */
#ifdef PWMA_SM0FRACVAL3_INIT
  PWMA->SM[0].FRACVAL3 = PWMA_SM0FRACVAL3_INIT;
#else
  PWMA->SM[0].FRACVAL3 = 0x0U;
#endif /* PWMA_SM0FRACVAL3_INIT */
#ifdef PWMA_SM0FRACVAL4_INIT
  PWMA->SM[0].FRACVAL4 = PWMA_SM0FRACVAL4_INIT;
#else
  PWMA->SM[0].FRACVAL4 = 0x0U;
#endif /* PWMA_SM0FRACVAL4_INIT */
#ifdef PWMA_SM0FRACVAL5_INIT
  PWMA->SM[0].FRACVAL5 = PWMA_SM0FRACVAL5_INIT;
#else
  PWMA->SM[0].FRACVAL5 = 0x0U;
#endif /* PWMA_SM0FRACVAL5_INIT */
#ifdef PWMA_SM0FRCTRL_INIT
  PWMA->SM[0].FRCTRL = PWMA_SM0FRCTRL_INIT;
#else
  PWMA->SM[0].FRCTRL = 0x0U;
#endif /* PWMA_SM0FRCTRL_INIT */
#endif /* (defined(PWMA_SM0_FRACTIONAL_BLOCK_AVAILABLE)) */
#ifdef PWMA_SM0OCTRL_INIT
  PWMA->SM[0].OCTRL = PWMA_SM0OCTRL_INIT;
#else
  PWMA->SM[0].OCTRL = 0x0U;
#endif /* PWMA_SM0OCTRL_INIT */
#ifdef PWMA_SM0STS_INIT
  PWMA->SM[0].STS = PWMA_SM0STS_INIT;
#else
  PWMA->SM[0].STS = 0x3fffU;
#endif /* PWMA_SM0STS_INIT */
#ifdef PWMA_SM0INTEN_INIT
  PWMA->SM[0].INTEN = PWMA_SM0INTEN_INIT;
#else
  PWMA->SM[0].INTEN = 0x0U;
#endif /* PWMA_SM0INTEN_INIT */
#ifdef PWMA_SM0DMAEN_INIT
  PWMA->SM[0].DMAEN = PWMA_SM0DMAEN_INIT;
#else
  PWMA->SM[0].DMAEN = 0x0U;
#endif /* PWMA_SM0DMAEN_INIT */
#ifdef PWMA_SM0TCTRL_INIT
  PWMA->SM[0].TCTRL = PWMA_SM0TCTRL_INIT;
#else
  PWMA->SM[0].TCTRL = 0x0U;
#endif /* PWMA_SM0TCTRL_INIT */
#ifdef PWMA_SM0DISMAP0_INIT
  PWMA->SM[0].DISMAP[0] = PWMA_SM0DISMAP0_INIT;
#else
  PWMA->SM[0].DISMAP[0] = 0xffffU;
#endif /* PWMA_SM0DISMAP0_INIT */
#ifdef PWMA_SM0DISMAP1_INIT
  PWMA->SM[0].DISMAP[1] = PWMA_SM0DISMAP1_INIT;
#else
  PWMA->SM[0].DISMAP[1] = 0xffffU;
#endif /* PWMA_SM0DISMAP1_INIT */
#ifdef PWMA_SM0DTCNT0_INIT
  PWMA->SM[0].DTCNT0 = PWMA_SM0DTCNT0_INIT;
#else
  PWMA->SM[0].DTCNT0 = 0x7ffU;
#endif /* PWMA_SM0DTCNT0_INIT */
#ifdef PWMA_SM0DTCNT1_INIT
  PWMA->SM[0].DTCNT1 = PWMA_SM0DTCNT1_INIT;
#else
  PWMA->SM[0].DTCNT1 = 0x7ffU;
#endif /* PWMA_SM0DTCNT1_INIT */

#ifdef PWM_CAPTCTRLA_EDGA0_MASK
#ifdef PWMA_SM0CAPTCTRLA_INIT
  PWMA->SM[0].CAPTCTRLA = PWMA_SM0CAPTCTRLA_INIT;
#else
  PWMA->SM[0].CAPTCTRLA = 0x0U;
#endif /* PWMA_SM0CAPTCTRLA_INIT */
#ifdef PWMA_SM0CAPTCOMPA_INIT
  PWMA->SM[0].CAPTCOMPA = PWMA_SM0CAPTCOMPA_INIT;
#else
  PWMA->SM[0].CAPTCOMPA = 0x0U;
#endif /* PWMA_SM0CAPTCOMPA_INIT */
#endif /* PWM_CAPTCTRLA_EDGA0_MASK */

