nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f81000evk/demo_apps/mc_pmsm/pmsm_enc/peripherals.c
/***********************************************************************************************************************
 * FreeMASTER initialization code
 **********************************************************************************************************************/
/* clang-format off */
/* TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
instance:
- name: 'FreeMASTER'
- type: 'freemaster'
- mode: 'general'
- custom_name_enabled: 'false'
- type_id: 'freemaster_14894d49d87e02d0dca5f799e22554da'
- functional_group: 'BOARD_InitPeripherals'
- config_sets:
  - freemaster_config:
    - FMSTR_DISABLE: 'false'
    - initFreemaster: 'true'
    - generalConfig:
      - commInterface: 'serial'
      - interruptMode: 'polling'
      - initType: 'true'
      - serialConfig:
        - peripheralUART: 'QSCI1'
        - clockSource: 'genericUartClockSource'
        - clockSourceFreq: 'BOARD_BootClockRUN'
        - u32BaudRateBps: '1'
        - parityMode_qsci: 'kQSCI_ParityDisabled'
        - dataBitCount_qsci: 'kQSCI_Data8Bit'
        - polarityMode_qsci: 'kQSCI_PolarityNormal'
        - enableUserInit: 'false'
        - user_init:
          - initFunctionID: 'SERIAL_communication_init'
        - enable_rx_irq: 'false'
        - interrupt_rx:
          - IRQn: 'kQSCI1_RCV_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_tx_irq: 'false'
        - interrupt_tx:
          - IRQn: 'kQSCI1_TDRE_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_err_irq: 'false'
        - interrupt_error:
          - IRQn: 'kQSCI1_RERR_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - enable_tridle_irq: 'false'
        - interrupt_tridle:
          - IRQn: 'kQSCI1_TRIDLE_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
      - dsc_eonce_config:
        - txRegInterruptEnable: 'false'
        - tx_interrupt_vector:
          - IRQn: 'kTX_REG_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
        - rxRegInterruptEnable: 'false'
        - rx_interrupt_vector:
          - IRQn: 'kRX_REG_VECTORn'
          - dsc_enable_interrrupt: ''
          - useDefaultISR: 'false'
          - enable_custom_name: 'false'
          - handler_custom_name: ''
      - FMSTR_COMM_BUFFER_SIZE: 'autoSize'
      - FMSTR_COMM_RQUEUE_SIZE: '32'
      - FMSTR_USE_SCOPE: '2'
      - FMSTR_MAX_SCOPE_VARS: '8'
      - FMSTR_REC_FLOAT_TRIG: 'false'
      - recorders:
        - 0:
          - recID:
            - enableCustomID: 'false'
          - nameRec: 'Description of recorder 0'
          - recBuff:
            - customBuffer: 'false'
            - bufferAddress: ''
            - bufferExternDef: ''
            - bufferSize: '1024'
          - basePeriod_ns: '0'
          - recInit: 'true'
      - FMSTR_USE_TSA: 'false'
      - FMSTR_USE_TSA_INROM: 'false'
      - FMSTR_USE_TSA_SAFETY: 'false'
      - FMSTR_USE_TSA_DYNAMIC: 'false'
      - tsaBufferInit: 'false'
      - tsaBuff:
        - customBuffer: 'false'
        - bufferAddress: ''
        - bufferExternDef: ''
        - bufferSize: ''
      - pipes: []
      - FMSTR_USE_READMEM: 'true'
      - FMSTR_USE_WRITEMEM: 'true'
      - FMSTR_USE_WRITEMEMMASK: 'true'
      - passR: ''
      - passRW: ''
      - passRWF: ''
      - FMSTR_USE_HASHED_PASSWORDS: 'false'
      - FMSTR_USE_APPCMD: 'false'
      - FMSTR_APPCMD_BUFF_SIZE: '32'
      - FMSTR_MAX_APPCMD_CALLS: '8'
      - FMSTR_DEBUG_LEVEL: '0'
      - FMSTR_DEBUG_PRINTF: 'debug_console'
      - FMSTR_DEBUG_TX: 'false'
      - FMSTR_CUSTOM_INCLUDES: '#include "fsl_common.h"'
      - FMSTR_CUSTOM_OPTIONS: '#ifdef DATA_IN_XFLASH\n// Target-side address translation (TSA)\n#define FMSTR_TSA_CDECL const __declspec(DATA_IN_XFLASH) __attribute__((far))\n#undef  FMSTR_USE_TSA\n#define
        FMSTR_USE_TSA           1   // Enable TSA functionality\n#endif // DATA_IN_XFLASH'
    - freemaster_codegenerator: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS **********/
/* clang-format on */
/* Recorder0 configuration */
FMSTR_U8 FreeMASTER_RecBuffer0[FREEMASTER_REC_0_SIZE];
FMSTR_REC_BUFF FreeMASTER_Recorder_0 = {
  .name = "Description of recorder 0",
  .addr = (FMSTR_ADDR)FreeMASTER_RecBuffer0,
  .size = (FMSTR_SIZE) sizeof(FreeMASTER_RecBuffer0),
  .basePeriod_ns = 0UL
};

static void FreeMASTER_init(void) {
  /* FreeMASTER middleware initialization */
  FMSTR_Init();
  /* FreeMASTER recorder 0 configuration initialization  */
  FMSTR_RecorderCreate(0, &FreeMASTER_Recorder_0);
}

/***********************************************************************************************************************
 * Initialization functions
 **********************************************************************************************************************/
static void BOARD_InitPeripherals_CommonPreInit(void)
{
  /* Enable clock gate of the ADC peripheral. */
  SIM->PCE2 |= SIM_PCE2_CYCADC_MASK;
  /* Enable clock gate of the CMPC peripheral. */
  SIM->PCE2 |= SIM_PCE2_CMPC_MASK;
  /* Disable all interrupts to prevent invoking of any interrupt during initialization of peripherals. */
  INTC->CTRL |= INTC_CTRL_INT_DIS_MASK;
  /* Enable clock gate of the PIT0 peripheral. */
  SIM->PCE2 |= SIM_PCE2_PIT0_MASK;
  /* Enable clock gate of the PWMA peripheral. */
  SIM->PCE3 |= SIM_PCE3_PWMACH0_MASK;
  /* Enable clock gate of the PWMA peripheral. */
  SIM->PCE3 |= SIM_PCE3_PWMACH1_MASK;
  /* Enable clock gate of the PWMA peripheral. */
  SIM->PCE3 |= SIM_PCE3_PWMACH2_MASK;
  /* Enable clock gate of the QSCI1 peripheral. */
  SIM->PCE1 |= SIM_PCE1_SCI1_MASK;
  /* Enable clock gate of the TMRA peripheral. */
  SIM->PCE0 |= SIM_PCE0_TA0_MASK;
}

static void BOARD_InitPeripherals_CommonPostInit(void)
{
  /* Set the interrupt priority: Priority 2 of the kADC_CC0_VECTORn request in the INTC. */
  INTC->IPR2 = (INTC->IPR2 & ~INTC_IPR2_ADC_CC0_MASK) | INTC_IPR2_ADC_CC0(3);
  /* Set the interrupt priority: Priority 0 of the kGPIOC_VECTORn request in the INTC. */
  INTC->IPR12 = (INTC->IPR12 & ~INTC_IPR12_GPIOC_MASK) | INTC_IPR12_GPIOC(1);
  /* Set the interrupt priority: Priority 1 of the kPIT0_ROLLOVR_VECTORn request in the INTC. */
  INTC->IPR10 = (INTC->IPR10 & ~INTC_IPR10_PIT0_ROLLOVR_MASK) | INTC_IPR10_PIT0_ROLLOVR(2);
  /* Enable all interrupts after initialization of peripherals. */
  INTC->CTRL &= ~INTC_CTRL_INT_DIS_MASK;
  /* Initialization of masked/enabled DSC core interrupt levels. */
  __EI(3);
}

void BOARD_InitPeripherals(void)
{
  /* Common pre-initialization */
  BOARD_InitPeripherals_CommonPreInit();
  /* Initialize components */
  ADC_init();
  CMPC_init();
  PIT0_init();
  PWMA_init();
  QSCI1_init();
  TMRA_init();
  FreeMASTER_init();
  /* Common post-initialization */
  BOARD_InitPeripherals_CommonPostInit();
}

/***********************************************************************************************************************
 * BOARD_InitBootPeripherals function
 **********************************************************************************************************************/
void BOARD_InitBootPeripherals(void)
{
  BOARD_InitPeripherals();
}
